src/cf/InformationRegisters/СотрудникиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/КалендариСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КалендариСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>backgroundColor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>colorId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>foregroundColor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>primary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>selected</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeZone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьСGoogle</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ЗадачиСотрудника/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	Если ТипЗнч(Форма.ВладелецФайла) <> Тип("ДокументСсылка.ЗадачаСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Ширина = 40;
	Форма.Высота = 30;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Команда = Команды.Добавить();
	Команда.Вид = "Органайзер";
	Команда.Идентификатор = "ЗадачаСотрудника";
	Команда.Представление = НСтр("ru = 'Создать задачу'");
	Команда.Важность = "Обычное";
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Картинка;
	Команда.Картинка = БиблиотекаКартинок.ЗадачаСотрудника;
	Команда.ТипПараметра = Метаданные.ОпределяемыеТипы.ОснованиеЗадачи.Тип;
	Команда.ФункциональныеОпции = "ИспользоватьЗадачиСотрудников";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.РежимЗаписи = "Записывать";
	Команда.Обработчик = "ЗадачиСотрудникаКлиент.СоздатьЗадачу";
	Команда.ТолькоВоВсехДействиях = Ложь;

КонецПроцедуры

#КонецОбласти

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.ПроверкаДокументаПередЗаписью = Истина;
	Настройки.ПроверкаДокументаПриЗаписи = Истина;
	
КонецПроцедуры

// Проверка документа перед записью.
// 
// Параметры:
//  Источник - ДокументОбъект.ЗадачаСотрудника - Источник
Процедура ПроверкаДокументаПередЗаписью(Источник) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентУправления.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьДополнительныеСвойства(Источник);
	
	ПроверитьИзменениеПоЗадачеПередЗаписью(Источник);
	
КонецПроцедуры

// Проверка документа при записи.
// 
// Параметры:
//  Источник - ДокументОбъект.ЗадачаСотрудника - Источник
Процедура ПроверкаДокументаПриЗаписи(Источник) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентУправления.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИзменениеРеквизитовЗадачиСотрудникаПриЗаписи(Источник);
	
КонецПроцедуры

Процедура ВыполнитьДействие(Действие, Контекст, ПараметрыЗадачи, ДополнительныеПараметры, Результат) Экспорт

	Если Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаВОбсуждении" ИЛИ
		Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаПоEmail" Тогда        
		
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			ДополнительныеПараметры.Вставить("Действие", Действие);
		Иначе     
			ТекстСообщенияОшибки = НСтр("ru='Дополнительные параметры не являются структурой'");
			ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщенияОшибки);
			Возврат;
		КонецЕсли;
		ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаВОбсуждении(Контекст, ПараметрыЗадачи, ДополнительныеПараметры, Результат);		
	КонецЕсли;
	
КонецПроцедуры        

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступные типы для формирования меню создания записи календаряподбора типа основания 
// для формы документа ЗадачаСотрудника
// 
// Возвращаемое значение:
//  Массив из Тип
Функция ДоступныеТипыМенюСозданияСобытияКалендаря() Экспорт

	ТипыЗаписей = Метаданные.ОпределяемыеТипы.ИсточникЗаписейКалендаря.Тип.Типы();
	ФункциональныеОпцииТиповЗаписей = ФункциональныеОпцииМенюСозданияЗаписиКалендаря();
	
	ДоступныеТипы = ФункциональныеОпцииУНФ.ДоступныеТипыПоФункциональнымОпциям(
		ТипыЗаписей, ФункциональныеОпцииТиповЗаписей);
	
	Возврат ДоступныеТипы;
	
КонецФункции

// Доступные типы меню выбора основания.
// 
// Возвращаемое значение:
//  СписокЗначений:
//		* Представление - Строка - Тип или "ПоказатьВсе"
//		* Значение - Строка - Представление в меню
Функция ДоступныеТипыМенюВыбораОснования() Экспорт

	ФункциональныеОпцииТиповОснований = ФункциональныеОпцииТиповОснованийМенюПодбора();
	
	ТипыОснований = ТипыОснованийМенюПодбора();
	ДоступныеТипы = ФункциональныеОпцииУНФ.ДоступныеТипыПоФункциональнымОпциям(
		ТипыОснований, ФункциональныеОпцииТиповОснований);
	
	ТипыОснованийЗадачи = Новый СписокЗначений;
	
	Для Каждого ДоступныйТип Из ДоступныеТипы Цикл
		
		Если ДоступныйТип = Тип("СправочникСсылка.Лиды") Тогда
			Представление = НСтр("ru = 'Лид'");
		ИначеЕсли ДоступныйТип = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			Представление = НСтр("ru = 'Контакт'");
		ИначеЕсли ДоступныйТип = Тип("СправочникСсылка.Контрагенты") Тогда
			Представление = НСтр("ru = 'Контрагент'");
		ИначеЕсли ДоступныйТип = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Представление = НСтр("ru = 'Заказ покупателя'");
		ИначеЕсли ДоступныйТип = Тип("ДокументСсылка.Событие") Тогда
			Представление = НСтр("ru = 'Событие'");
		Иначе
			ТипМетаданных = Метаданные.НайтиПоТипу(ДоступныйТип);
			ПредставлениеОбъекта = ТипМетаданных.ПредставлениеОбъекта;
			Представление = ?(ПустаяСтрока(ПредставлениеОбъекта), ТипМетаданных.Синоним, ПредставлениеОбъекта);
		КонецЕсли;
		
		ТипыОснованийЗадачи.Добавить(ДоступныйТип, Представление);
		
	КонецЦикла;
	
	ТипыОснованийЗадачи.Добавить("ПоказатьВсе", НСтр("ru = 'Показать все'"));
	
	Возврат ТипыОснованийЗадачи;
	
КонецФункции

// Возвращает доступные типы оснований документа ЗадачаСотрудника согласно установленным Функциональным опциям.
// 
// Возвращаемое значение:
//  Массив из Тип
Функция ДоступныеТипыОснованийЗадачиСотрудника() Экспорт	
	
	ТипыОснований = Метаданные.ОпределяемыеТипы.ОснованиеЗадачи.Тип.Типы();
	ФункциональныеОпцииТиповОснований = ФункциональныеОпцииТиповОснований();
	
	ДоступныеТипы = ФункциональныеОпцииУНФ.ДоступныеТипыПоФункциональнымОпциям(
		ТипыОснований, ФункциональныеОпцииТиповОснований);
	
	Возврат ДоступныеТипы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаВОбсуждении(Контекст, ПараметрыЗадачи, ДополнительныеПараметры, Результат) Экспорт
	
	ЗадачаСотрудника = Контекст.Предмет;    
	ЗадачаАссистента = Контекст.Задача;
	ТекстСообщения = "";
	ЗадачаАссистентаОбъект = ЗадачаАссистента.ПолучитьОбъект();	
	Если ЗадачаАссистентаОбъект.ЗначенияЗаполнения.Количество() = 0 Тогда
		ТекстСообщенияОшибки = НСтр("ru='Не заполнены параметры Задачи ассистента'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;       
	
	Если ТипЗнч(ЗадачаАссистента.ЗначенияЗаполнения[0].Значение) <> Тип("ХранилищеЗначения") Тогда
		ТекстСообщенияОшибки = НСтр("ru='Неверный тип параметров Задачи ассистента'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	ПараметрыЗадачи = ЗадачаАссистента.ЗначенияЗаполнения[0].Значение.Получить();   
	Если ТипЗнч(ПараметрыЗадачи) <> Тип("Структура") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента сохранена не структура'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	Если НЕ ПараметрыЗадачи.Свойство("МассивСотрудников") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан Массив сотрудников'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	МассивКонтролируемыхСотрудников = ПараметрыЗадачи.МассивСотрудников;	
	
	Если ТипЗнч(ЗадачаСотрудника) <> Тип("ДокументСсылка.ЗадачаСотрудника") Тогда
		ТекстСообщенияОшибки = НСтр("ru='Попытка отправки сообщения по объекту, не являющемуся Задачей сотрудника'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      

	Если НЕ ПараметрыЗадачи.Свойство("КалендарьСотрудникСотрудники") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр КалендарьСотрудникСотрудники'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;   
	
	Если НЕ ПараметрыЗадачи.Свойство("КонтролируемыйСотрудник") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Контролируемый сотрудник'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	Если НЕ ПараметрыЗадачи.Свойство("КонтролируемыйКалендарь") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Контролируемый календарь'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	ЭтоНовый = ДополнительныеПараметры.ЭтоНовый;
	Действие = ДополнительныеПараметры.Действие;        
	КалендарьСотрудникСотрудники = ПараметрыЗадачи.КалендарьСотрудникСотрудники;
	ЭтоКонтрольСотрудника = (КалендарьСотрудникСотрудники = 0);
	ЭтоКонтрольКалендарь = (КалендарьСотрудникСотрудники = 1);
	ЭтоКонтрольСотрудникиКалендарь = (КалендарьСотрудникСотрудники = 2);
	ЭтоКонтрольСотрудников = (КалендарьСотрудникСотрудники = 3);
	ЭтоОбсуждение = (Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаВОбсуждении");
	ЭтоEmail      = (Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаПоEmail");

	ОтветственныйИлиАвтор = ПараметрыЗадачи.ОтветственныйИлиАвтор;  
	КонтролируемыйКалендарь = ПараметрыЗадачи.КонтролируемыйКалендарь;  
	
	СтруктураПараметровЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСотрудника, "Ответственный, Календарь, Автор");
	Если ЭтоНовый = Ложь Тогда
		ПредыдущийОтветственный = ДополнительныеПараметры.СтарыеЗначенияРеквизитов.Ответственный;
		ПредыдущийКалендарь = ДополнительныеПараметры.СтарыеЗначенияРеквизитов.Календарь;    
	Иначе 
		ПредыдущийОтветственный = Неопределено;
		ПредыдущийКалендарь = Неопределено;
	КонецЕсли;      
	
	СтруктураПараметровЗадачи.Вставить("ПредыдущийОтветственный", ПредыдущийОтветственный);
	СтруктураПараметровЗадачи.Вставить("ПредыдущийКалендарь", ПредыдущийКалендарь);
	СтруктураПараметровЗадачи.Вставить("КонтролируемыйКалендарь", КонтролируемыйКалендарь);
	СтруктураПараметровЗадачи.Вставить("КалендарьСотрудникСотрудники", КалендарьСотрудникСотрудники);
	СтруктураПараметровЗадачи.Вставить("ОтветственныйИлиАвтор", ОтветственныйИлиАвтор);
	Автор  = СтруктураПараметровЗадачи.Автор;
	
	
	НужноОтправитьСообщение = Ложь;
	Если ЭтоКонтрольСотрудника = Истина Тогда    
		КонтролируемыйСотрудник = ПараметрыЗадачи.КонтролируемыйСотрудник;	
		Если СотрудникСоответствуетКритериямОтправкиСообщения(СтруктураПараметровЗадачи, КонтролируемыйСотрудник) Тогда 
			НужноОтправитьСообщение = Истина;   			
		КонецЕсли;      

		Если НужноОтправитьСообщение = Ложь И ОтветственныйИлиАвтор = 1 ИЛИ ОтветственныйИлиАвтор = 2 Тогда 
			СотрудникиАвтора = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(Автор);
			Если СотрудникиАвтора.Найти(КонтролируемыйСотрудник) <> Неопределено Тогда  
				НужноОтправитьСообщение = Истина;   			
			КонецЕсли;      
		КонецЕсли;      
	ИначеЕсли ЭтоКонтрольКалендарь Тогда   
		Если КонтролируемыйКалендарь = СтруктураПараметровЗадачи.Календарь ИЛИ КонтролируемыйКалендарь = СтруктураПараметровЗадачи.ПредыдущийКалендарь  Тогда
			НужноОтправитьСообщение = Истина;   
		КонецЕсли;      		
	ИначеЕсли ЭтоКонтрольСотрудникиКалендарь = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендариСотрудниковДоступ.Сотрудник КАК Сотрудник
		|ИЗ
		|	Справочник.КалендариСотрудников.Доступ КАК КалендариСотрудниковДоступ
		|ГДЕ
		|	КалендариСотрудниковДоступ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КалендариСотрудников.ВладелецКалендаря
		|ИЗ
		|	Справочник.КалендариСотрудников КАК КалендариСотрудников
		|ГДЕ
		|	КалендариСотрудников.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрыЗадачи.КонтролируемыйКалендарь);  
		Выборка = Запрос.Выполнить().Выбрать();       
		МассивСотрудников = Новый Массив;
		Пока Выборка.Следующий() Цикл    
			МассивСотрудников.Добавить(Выборка.Сотрудник);
			Если СотрудникСоответствуетКритериямОтправкиСообщения(СтруктураПараметровЗадачи, Выборка.Сотрудник)  Тогда
				НужноОтправитьСообщение = Истина;   
				Прервать;
			КонецЕсли;      
		КонецЦикла;	
		Если НужноОтправитьСообщение = Ложь И ОтветственныйИлиАвтор = 1 ИЛИ ОтветственныйИлиАвтор = 2 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиПользователя.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
			|ГДЕ
			|	СотрудникиПользователя.Сотрудник В (&МассивСотрудников)
			|	И  НЕ СотрудникиПользователя.Пользователь.Недействителен
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникиПользователя.Пользователь.Наименование";
			Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников); 
			Выборка = Запрос.Выполнить().Выбрать();   
			Пока Выборка.Следующий() Цикл  
				Если Выборка.Пользователь = Автор Тогда
					НужноОтправитьСообщение = Истина;   
					Прервать;
				КонецЕсли;      
			КонецЦикла;	
					
		КонецЕсли;
	ИначеЕсли ЭтоКонтрольСотрудников = Истина Тогда
		
		Для Каждого КонтролируемыйСотрудник Из МассивКонтролируемыхСотрудников Цикл
			Если СотрудникСоответствуетКритериямОтправкиСообщения(СтруктураПараметровЗадачи, КонтролируемыйСотрудник) Тогда   
				НужноОтправитьСообщение = Истина;   				
				Прервать;
			КонецЕсли;      
		КонецЦикла;             
		
		Если НужноОтправитьСообщение = Ложь И ОтветственныйИлиАвтор = 1 ИЛИ ОтветственныйИлиАвтор = 2 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиПользователя.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
			|ГДЕ
			|	СотрудникиПользователя.Сотрудник В (&МассивСотрудников)
			|	И  НЕ СотрудникиПользователя.Пользователь.Недействителен
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникиПользователя.Пользователь.Наименование";
			Запрос.УстановитьПараметр("МассивСотрудников", МассивКонтролируемыхСотрудников); 
			Выборка = Запрос.Выполнить().Выбрать();   
			Пока Выборка.Следующий() Цикл  
				Если Выборка.Пользователь = Автор Тогда
					НужноОтправитьСообщение = Истина;   
					Прервать;
				КонецЕсли;      
			КонецЦикла;	
		КонецЕсли;  
	КонецЕсли;  
	
	Если НужноОтправитьСообщение = Ложь Тогда
		Возврат;		
	КонецЕсли;  
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда     
		ТекстСообщенияОшибки = НСтр("ru='В дополнительны параметрах передана не структура'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметры.Свойство("ИзмененияПоЗадаче") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан тест изменений по задаче'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	
	Если ЭтоНовый = Ложь Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='По задаче %1 произошли следующие изменения:
							|%2'"),
		?(ЭтоEmail = Истина, Строка(ЗадачаСотрудника),ПолучитьНавигационнуюСсылку(ЗадачаСотрудника)),
		ДополнительныеПараметры.ИзмененияПоЗадаче);  
	Иначе  
		ТекстСообщения = СтрШаблон(НСтр("ru='Создана новая задача %1:
							|%2'"), 
		?(ЭтоEmail = Истина, Строка(ЗадачаСотрудника),ПолучитьНавигационнуюСсылку(ЗадачаСотрудника)),
		ДополнительныеПараметры.ИзмененияПоЗадаче);  		
	КонецЕсли;
	
	Если ТекстСообщения = "" Тогда
		ТекстСообщенияОшибки = НСтр("ru='По задаче %1 имеются проблемы с переданными данными отправки сообщения'");
		ТекстСообщенияОшибки = СтрШаблон(ТекстСообщения, Строка(ЗадачаСотрудника));
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;                 
	
	Если НЕ ПараметрыЗадачи.Свойство("КалендарьОтправки") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Календарь отправки'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;      
	Если ЭтоОбсуждение И НЕ ПараметрыЗадачи.Свойство("ИдентификаторОбщегоОбсуждения") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Идентификатор общего обсуждения'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;       
	Если ЭтоEmail И НЕ ПараметрыЗадачи.Свойство("УчетнаяЗапись") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Учетная запись'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;       
	
	Если НЕ ПараметрыЗадачи.Свойство("ПользовательДляОповещения") Тогда
		ТекстСообщенияОшибки = НСтр("ru='В параметрах Задачи ассистента не передан параметр Пользователь для оповещения'");
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
		Возврат;
	КонецЕсли;     
	
	Действие = ДополнительныеПараметры.Действие;
	Если Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаВОбсуждении" Тогда	

		Если НЕ ОбсужденияУНФ.ЭтоСеансАвторизованногоПользователя()	Тогда    
			ПользовательАссистент = АссистентУправления.ПользовательАссистент();
			Если ПользовательАссистент <> Неопределено И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПользовательАссистент)) Тогда
				ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательАссистент, "ИдентификаторПользователяИБ");
				СистемаВзаимодействия.УстановитьТекущегоПользователя(ИдентификаторПользователяИБ);   
			Иначе
				ТекстСообщенияОшибки = НСтр("ru='Не удалось определить пользователя Ассистента взаимодействия. Для создания пользователя внесите изменения во включенный навык Ассистента.'");
				ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Ошибка,,ЗадачаСотрудника, ТекстСообщенияОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеСообщения = ОбсужденияУНФ.НовыйДанныеСообщения();
		Если ЗначениеЗаполнено(ПараметрыЗадачи.КалендарьОтправки) Тогда
			Если Не ЗначениеЗаполнено(ПараметрыЗадачи.ИдентификаторОбщегоОбсуждения) Тогда
				НовыйИдентификаторОбщегоОбсуждения = СоздатьГрупповойЧатПоКалендарю(ПараметрыЗадачи, ЗадачаАссистента);	
			Иначе
				ОбновитьГрупповойЧатПоКалендарю(ПараметрыЗадачи);  
				НовыйИдентификаторОбщегоОбсуждения = ПараметрыЗадачи.ИдентификаторОбщегоОбсуждения;
			КонецЕсли; 
			ОбъектСообщения = НовыйИдентификаторОбщегоОбсуждения;    
			
		ИначеЕсли ЗначениеЗаполнено(ПараметрыЗадачи.ИдентификаторОбщегоОбсуждения) Тогда 
			ОбъектСообщения = ПараметрыЗадачи.ИдентификаторОбщегоОбсуждения;    
		ИначеЕсли ЗначениеЗаполнено(ПараметрыЗадачи.ПользовательДляОповещения) Тогда
			ОбъектСообщения = ПараметрыЗадачи.ПользовательДляОповещения;   
		КонецЕсли;
		
		ДанныеСообщения.Текст = ТекстСообщения;      
		ДанныеСообщения.Объект = ОбъектСообщения;      
		ДанныеСообщения.Автор = АссистентУправления.ПользовательАссистент(); 
		Результат.ДанныеСообщений.Добавить(ДанныеСообщения);
		
	ИначеЕсли Действие = "ОповеститьСотрудникаОбИзмененииЗадачиСотрудникаПоEmail" Тогда	     
		
		ОбработатьОтправкуПисьмаПоИзменениямВЗадаче(ПараметрыЗадачи, ЗадачаСотрудника, ТекстСообщения, ЭтоНовый);
	
	КонецЕсли;
	
	
КонецПроцедуры

Функция СотрудникСоответствуетКритериямОтправкиСообщения(СтруктураПараметровЗадачи, КонтролируемыйСотрудник)
	
	//КонтролируемыйСотрудник  = СтруктураПараметровЗадачи.КонтролируемыйСотрудник;
	ОтветственныйИлиАвтор  = СтруктураПараметровЗадачи.ОтветственныйИлиАвтор;
	Ответственный  = СтруктураПараметровЗадачи.Ответственный;
	ПредыдущийОтветственный  = СтруктураПараметровЗадачи.ПредыдущийОтветственный;
	Автор  = СтруктураПараметровЗадачи.Автор;
	Календарь  = СтруктураПараметровЗадачи.Календарь;
	ПредыдущийКалендарь  = СтруктураПараметровЗадачи.ПредыдущийКалендарь;
	КонтролируемыйКалендарь  = СтруктураПараметровЗадачи.КонтролируемыйКалендарь;
	КалендарьСотрудникСотрудники  = СтруктураПараметровЗадачи.КалендарьСотрудникСотрудники;
	  
	Если КалендарьСотрудникСотрудники <> 1 Тогда
		Если (ОтветственныйИлиАвтор = 0 ИЛИ ОтветственныйИлиАвтор = 2) И (КонтролируемыйСотрудник = Ответственный
			ИЛИ КонтролируемыйСотрудник = ПредыдущийОтветственный) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;	
		КонецЕсли;
	Иначе   
		Возврат Календарь = КонтролируемыйКалендарь ИЛИ ПредыдущийКалендарь = КонтролируемыйКалендарь;		
	КонецЕсли; 	
	
КонецФункции

Функция ФункциональныеОпцииТиповОснований()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"),   "ИспользоватьАктыВыполненныхРабот");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ИнвентаризацияЗапасов"), "ИспользоватьПодсистемуСклад");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПриемИПередачаВРемонт"), "ИспользоватьРемонты");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПланПродаж"),           "ПланированиеПродаж");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Проекты"),            "УчетПоПроектам");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомитенту"),       "ПриемТоваровНаКомиссию");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"),  "ИспользоватьПодсистемуПроизводство");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОперацияПоПлатежнымКартам"), "ИспользоватьОплатуКартами");
	
	ИмяФункциональнойОпции = "ИспользоватьКорректировкиПоступлений"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхождениях"),         ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.КорректировкаПоступления"), ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "ИспользоватьКорректировкиРеализаций"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.АктОРасхожденияхПолученный"), ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.КорректировкаРеализации"), 	ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "КредитыИЗаймы"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ДоговорКредитаИЗайма"), 		 ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.НачисленияПоКредитамИЗаймам"), ИмяФункциональнойОпции);
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаданиеНаРаботу"), 		"ИспользоватьЗаданияНаРаботу");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПеремещение"), 	"УчетПоНесколькимСкладам");
	
	ИмяФункциональнойОпции = "ИспользоватьПодсистемуЗакупки"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"), ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"), 		ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "ПередачаТоваровНаКомиссию"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПереоценкаТоваровНаКомиссии"), ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионера"),           ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"),  ИмяФункциональнойОпции);
	
	ИмяФункциональнойОпции = "ИспользоватьПодсистемуЗарплата"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПлатежнаяВедомость"), 	ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПриемНаРаботуУНФ"), 		ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.НачислениеЗарплатыУНФ"), 	ИмяФункциональнойОпции);
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СверкаВзаиморасчетов"), 	"СверкиВзаиморасчетов");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.СчетНаОплату"), 			"ИспользоватьСчетаНаОплату");

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.ДоговорыКонтрагентов"), "ИспользоватьДоговорыКонтрагентов");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛица"), 		"ИспользоватьКонтактыКонтрагентов");
	
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетОПереработке"), 	"ПереработкаДавальческогоСырья");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ОтчетПереработчика"), "ПередачаСырьяВПереработку");	
	
	ИмяФункциональнойОпции = "ПлатежныйКалендарь"; 
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПеремещениеДСПлан"), 	ИмяФункциональнойОпции);
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.РасходДСПлан"), 		ИмяФункциональнойОпции);
	
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Лиды"), 			"ИспользоватьЛиды");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"), 			"ИспользоватьСобытия");

	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"),
		"ПередачаТоваровМеждуОрганизациями");

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

Функция ТипыОснованийМенюПодбора()

	ТипыОснований = Новый Массив;
	ТипыОснований.Добавить(Тип("СправочникСсылка.Лиды"));
	ТипыОснований.Добавить(Тип("СправочникСсылка.КонтактныеЛица"));
	ТипыОснований.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТипыОснований.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ТипыОснований.Добавить(Тип("ДокументСсылка.Событие"));
	
	Возврат ТипыОснований;
	
КонецФункции

Функция ФункциональныеОпцииТиповОснованийМенюПодбора()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Лиды"),           "ИспользоватьЛиды");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.КонтактныеЛица"), "ИспользоватьКонтактыКонтрагентов");
	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.Контрагенты"),    "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПокупателя"),  "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"),          "ИспользоватьСобытия");	

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

Функция ФункциональныеОпцииМенюСозданияЗаписиКалендаря()
	
	ФункциональныеОпцииТипов = Новый Соответствие;

	ФункциональныеОпцииТипов.Вставить(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"),
		"ИспользоватьКалендарьПодготовкиОтчетности");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаданиеНаРаботу"),   "ИспользоватьЗаданияНаРаботу");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказПокупателя"),   "");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"), "ИспользоватьПодсистемуПроизводство");
	ФункциональныеОпцииТипов.Вставить(Тип("ДокументСсылка.Событие"),             "ИспользоватьСобытия");	

	Возврат ФункциональныеОпцииТипов;
	
КонецФункции

Процедура ПроверитьИзменениеПоЗадачеПередЗаписью(Источник)     
	
	Если ТипЗнч(Источник) <> Тип("ДокументОбъект.ЗадачаСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	СтарыеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, 
		"Ответственный, Выполнена, ДатаНачала, ДатаОкончания, Календарь, Описание, Основание, Результат, ВесьДень");
	
	Источник.ДополнительныеСвойства.АссистентУправления.ЗадачиСотрудника.Вставить("СтарыеЗначенияРеквизитов", СтарыеЗначенияРеквизитов);
	Источник.ДополнительныеСвойства.АссистентУправления.ЗадачиСотрудника.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
КонецПроцедуры	

Процедура ПроверитьИзменениеРеквизитовЗадачиСотрудникаПриЗаписи(Источник)
	
	Если ТипЗнч(Источник) <> Тип("ДокументОбъект.ЗадачаСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ДополнительныеСвойства.АссистентУправления.Свойство("ЗадачиСотрудника") Тогда
		Возврат;
	КонецЕсли;      
	
	Если Не Источник.ДополнительныеСвойства.АссистентУправления.ЗадачиСотрудника.Свойство("СтарыеЗначенияРеквизитов") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Источник.ДополнительныеСвойства.АссистентУправления.ЗадачиСотрудника.ЭтоНовый;
	МассивСообщений = Новый Массив;
	
	Если ЭтоНовый = Ложь Тогда           
			
		СтарыеЗначенияРеквизитов = Источник.ДополнительныеСвойства.АссистентУправления.ЗадачиСотрудника.СтарыеЗначенияРеквизитов;
		Если СтарыеЗначенияРеквизитов.ДатаНачала <> Источник.ДатаНачала Тогда
			МассивСообщений.Добавить("Дата начала: " + СтарыеЗначенияРеквизитов.ДатаНачала 
				+ " → " + Источник.ДатаНачала);
		КонецЕсли;
		Если СтарыеЗначенияРеквизитов.ДатаОкончания <> Источник.ДатаОкончания Тогда
			МассивСообщений.Добавить("Дата окончания: " + СтарыеЗначенияРеквизитов.ДатаОкончания 
				+ " → " + Источник.ДатаОкончания);
		КонецЕсли;                         
		Если СтарыеЗначенияРеквизитов.Ответственный <> Источник.Ответственный Тогда
			МассивСообщений.Добавить("Ответственный: " + СтарыеЗначенияРеквизитов.Ответственный 
				+ " → " + Источник.Ответственный);
		КонецЕсли;                         
		
		Если СтарыеЗначенияРеквизитов.Календарь <> Источник.Календарь Тогда
			МассивСообщений.Добавить("Календарь: " + СтарыеЗначенияРеквизитов.Календарь 
				+ " → " + Источник.Календарь);
		КонецЕсли;      
		
		Если СтарыеЗначенияРеквизитов.Основание <> Источник.Основание Тогда    
			Если ЗначениеЗаполнено(СтарыеЗначенияРеквизитов.Основание) И ЗначениеЗаполнено(Источник.Основание) Тогда
				МассивСообщений.Добавить("Основание: " + СтарыеЗначенияРеквизитов.Основание 
				+ " → " + Источник.Основание);
			ИначеЕсли ЗначениеЗаполнено(СтарыеЗначенияРеквизитов.Основание) И НЕ ЗначениеЗаполнено(Источник.Основание) Тогда
	       		МассивСообщений.Добавить("Основание очищено");	
			ИначеЕсли НЕ ЗначениеЗаполнено(СтарыеЗначенияРеквизитов.Основание) И ЗначениеЗаполнено(Источник.Основание) Тогда
	       		МассивСообщений.Добавить("Основание стало: " + Источник.Основание);	
			КонецЕсли;     		
		КонецЕсли;     		
		
		Если СтарыеЗначенияРеквизитов.Описание <> Источник.Описание Тогда
			МассивСообщений.Добавить("Описание стало: " + Источник.Описание);
		КонецЕсли;   
		
		Если СтарыеЗначенияРеквизитов.Результат <> Источник.Результат Тогда
			МассивСообщений.Добавить("Результат стал: " + Источник.Результат);
		КонецЕсли;
		
		Если СтарыеЗначенияРеквизитов.Выполнена <> Источник.Выполнена Тогда 
			Если Источник.Выполнена Тогда
				МассивСообщений.Добавить("Стала выполненной");
			Иначе
				МассивСообщений.Добавить("Стала невыполненной");				
			КонецЕсли;
		КонецЕсли;  
	Иначе
		МассивСообщений.Добавить("Дата начала: " + Источник.ДатаНачала); 
		МассивСообщений.Добавить("Дата окончания: " + Источник.ДатаОкончания); 
		МассивСообщений.Добавить("Ответственный: " + Источник.Ответственный); 
		МассивСообщений.Добавить("Календарь: " + Источник.Календарь); 
		МассивСообщений.Добавить("Описание: " + Источник.Описание); 
		Если ЗначениеЗаполнено (Источник.Основание) Тогда 
			 МассивСообщений.Добавить("Основание: " + 
			 ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Источник.Основание)), 
			 Строка(ПолучитьНавигационнуюСсылку(Источник.Основание)),
			 Источник.Основание)); 
		КонецЕсли;
		
	КонецЕсли;
		
	Если МассивСообщений.Количество() <> 0 Тогда
		ТекстСообщенияВсеЗадачиСтрокой = СтрСоединить(МассивСообщений, Символы.ПС);          
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИзмененияПоЗадаче", ТекстСообщенияВсеЗадачиСтрокой);
		ДопПараметры.Вставить("СтарыеЗначенияРеквизитов", СтарыеЗначенияРеквизитов);
		ДопПараметры.Вставить("ЭтоНовый", ЭтоНовый);
		
		ТекущееСобытие = "ПриИзмененииДанныхЗадачаСотрудника";                       
		
		АссистентУправления.ПриСрабатыванииСобытия2(ТекущийМенеджер(), ТекущееСобытие, Источник.Ссылка,, ДопПараметры);			
	КонецЕсли;
				
	
КонецПроцедуры

Функция ТекущийМенеджер()
	
	Возврат "ЗадачиСотрудника";
	
КонецФункции

Процедура ДобавитьДополнительныеСвойства(Объект)
	
	Если НЕ Объект.ДополнительныеСвойства.АссистентУправления.Свойство(ТекущийМенеджер()) Тогда
		Объект.ДополнительныеСвойства.АссистентУправления.Вставить(ТекущийМенеджер(), Новый Структура);
	КонецЕсли;
	
КонецПроцедуры 

Функция СоздатьГрупповойЧатПоКалендарю(ПараметрыЗадачи, ЗадачаАссистента)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПользователей = ПолучитьПользователейКалендаряОтправки(ПараметрыЗадачи.КалендарьОтправки);
	КалендарьСотрудникСотрудники = ПараметрыЗадачи.КалендарьСотрудникСотрудники;
	
	НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	НовоеОбсуждение.Групповое = Истина;
	Для Каждого Пользователь Из МассивПользователей Цикл
		ИдентификаторПользователя = Обсуждения.ПользовательСистемыВзаимодействия(Пользователь, Истина);
		НовоеОбсуждение.Участники.Добавить(ИдентификаторПользователя);  
	КонецЦикла;  
	
	ШаблонЗаголовок = НСтр("ru='%1: изменения в задачах по %2'"); 
	Если КалендарьСотрудникСотрудники = 0 Тогда 
		СтрокаПо = "сотруднику " + ПараметрыЗадачи.КонтролируемыйСотрудник;	 
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		СтрокаПо = "календарю " + ПараметрыЗадачи.КонтролируемыйКалендарь;
	ИначеЕсли КалендарьСотрудникСотрудники = 2 Тогда	   
		СтрокаПо = "сотрудникам календаря " + ПараметрыЗадачи.КонтролируемыйКалендарь;
	Иначе
		СтрокаПо = "нескольким сотрудникам";
	КонецЕсли;                  
	НовыйЗаголовок = СтрШаблон(ШаблонЗаголовок, Строка(ПараметрыЗадачи.КалендарьОтправки), СтрокаПо);
	НовоеОбсуждение.Заголовок = НовыйЗаголовок; 
	НовоеОбсуждение.Записать();    
	
	ЗадачаАссистентаОбъект = ЗадачаАссистента.ПолучитьОбъект();
	ЗадачаАссистентаОбъект.ОбменДанными.Загрузка = Истина;    
	ПараметрыЗадачиСохраненные = ЗадачаАссистентаОбъект.ЗначенияЗаполнения[0].Значение.Получить();
	ПараметрыЗадачиСохраненные.ИдентификаторОбщегоОбсуждения = НовоеОбсуждение.Идентификатор;   
	ЗадачаАссистентаОбъект.ЗначенияЗаполнения.Очистить();
	СтрокаНастройки = ЗадачаАссистентаОбъект.ЗначенияЗаполнения.Добавить();
	СтрокаНастройки.Параметр = "СтруктураНастроек";
	СтрокаНастройки.Значение = Новый ХранилищеЗначения(ПараметрыЗадачиСохраненные);
	ЗадачаАссистентаОбъект.Записать();
	ЗадачаАссистентаОбъект.ОбменДанными.Загрузка = Ложь;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НовоеОбсуждение.Идентификатор;
	
КонецФункции 

Процедура ОбновитьГрупповойЧатПоКалендарю(ПараметрыЗадачи)
	
	УстановитьПривилегированныйРежим(Истина);       
	КалендарьСотрудникСотрудники = ПараметрыЗадачи.КалендарьСотрудникСотрудники;

	ШаблонЗаголовок = НСтр("ru='%1: изменения в задачах по %2'"); 
	Если КалендарьСотрудникСотрудники = 0 Тогда 
		СтрокаПо = "сотруднику " + ПараметрыЗадачи.КонтролируемыйСотрудник;	 
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		СтрокаПо = "календарю " + ПараметрыЗадачи.КонтролируемыйКалендарь;
	ИначеЕсли КалендарьСотрудникСотрудники = 2 Тогда	   
		СтрокаПо = "сотрудникам календаря " + ПараметрыЗадачи.КонтролируемыйКалендарь;
	Иначе
		СтрокаПо = "нескольким сотрудникам";
	КонецЕсли;                  
	НовыйЗаголовок = СтрШаблон(ШаблонЗаголовок, Строка(ПараметрыЗадачи.КалендарьОтправки), СтрокаПо);
	
	МассивПользователей = ПолучитьПользователейКалендаряОтправки(ПараметрыЗадачи.КалендарьОтправки);
	ОбновляемоеОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(Новый ИдентификаторОбсужденияСистемыВзаимодействия(ПараметрыЗадачи.ИдентификаторОбщегоОбсуждения));
    ЕстьИзменения = Ложь;              
	МассивИдентификаторовАктуальныхПользователей = Новый Массив;
	Для Каждого Пользователь Из МассивПользователей Цикл
		ИдентификаторПользователя = Обсуждения.ПользовательСистемыВзаимодействия(Пользователь, Истина);
		МассивИдентификаторовАктуальныхПользователей.Добавить(ИдентификаторПользователя);
		Если НЕ ОбновляемоеОбсуждение.Участники.Содержит(ИдентификаторПользователя) Тогда
			ОбновляемоеОбсуждение.Участники.Добавить(ИдентификаторПользователя); 
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;     
	
	МассивНеактуальныхИдентификаторов = Новый Массив;
	Для Каждого Участник Из ОбновляемоеОбсуждение.Участники Цикл
		Если МассивИдентификаторовАктуальныхПользователей.Найти(Участник) = Неопределено Тогда	
			МассивНеактуальныхИдентификаторов.Добавить(Участник);
		КонецЕсли;
	КонецЦикла;       
	
	Для Каждого НеактуальныйУчастник Из МассивНеактуальныхИдентификаторов Цикл   
		ЕстьИзменения = Истина;		
		ОбновляемоеОбсуждение.Участники.Удалить(НеактуальныйУчастник);
	КонецЦикла;       
	
	Если ОбновляемоеОбсуждение.Заголовок <> НовыйЗаголовок Тогда
		ЕстьИзменения = Истина;		
		ОбновляемоеОбсуждение.Заголовок = НовыйЗаголовок;	
	КонецЕсли;
	Если ЕстьИзменения = Истина Тогда         	
		ОбновляемоеОбсуждение.Записать();  
	КонецЕсли;         
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Функция ПолучитьПользователейКалендаряОтправки(КалендарьОтправки)
	
	МассивПользователей = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендариСотрудниковДоступ.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ втСотрудникиОтправки
		|ИЗ
		|	Справочник.КалендариСотрудников.Доступ КАК КалендариСотрудниковДоступ
		|ГДЕ
		|	КалендариСотрудниковДоступ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КалендариСотрудников.ВладелецКалендаря
		|ИЗ
		|	Справочник.КалендариСотрудников КАК КалендариСотрудников
		|ГДЕ
		|	КалендариСотрудников.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПользователя.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудникиОтправки КАК втСотрудникиОтправки
		|		ПО СотрудникиПользователя.Сотрудник = втСотрудникиОтправки.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", КалендарьОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции

Процедура ОбработатьОтправкуПисьмаПоИзменениямВЗадаче(ПараметрыЗадачи, ЗадачаСотрудника, ТекстСообщения, ЭтоНовый)
	
	ПользовательОтветственный = ПараметрыЗадачи.ПользовательДляПисем;
	КонтактнаяИнформацияПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
	ПользовательОтветственный, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Ложь);
	
	АдресаЭлектроннойПочты = Новый Массив;
	Для каждого ДанныеКонтактнойИнформации Из КонтактнаяИнформацияПользователя Цикл
		ОписаниеПолучателя = Новый Структура;
		ОписаниеПолучателя.Вставить("Адрес", ДанныеКонтактнойИнформации.Представление);
		ОписаниеПолучателя.Вставить("Представление", Строка(ПользовательОтветственный));
		АдресаЭлектроннойПочты.Добавить(ОписаниеПолучателя);
	КонецЦикла;                                          
	
	Если АдресаЭлектроннойПочты.Количество() = 0 Тогда
		ТекстСообщенияОшибка = НСтр("ru='У пользователя %1 не указано ни одного адреса электронной почты'");
		ТекстСообщенияОшибка = СтрШаблон(ТекстСообщенияОшибка, Строка(ПользовательОтветственный));
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиПочтовогоОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Предупреждение,,ПользовательОтветственный, ТекстСообщенияОшибка);
		Возврат;
	КонецЕсли;	
	
	ТекстПисьма = ТекстСообщения;  
	
	КомпонентыСтроки = Новый Массив;
	КомпонентыСтроки.Добавить(НСтр("ru='Добрый день!'"));
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(ТекстСообщения);
	ТекстПисьма = СтрСоединить(КомпонентыСтроки);
	КомпонентыСтроки = Новый Массив;
	КомпонентыСтроки.Добавить(ТекстПисьма);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(НСтр("ru='С уважением, Даша
	|Ассистент 1С:Управление нашей фирмой'"));
	ТекстПисьма = СтрСоединить(КомпонентыСтроки);
	
	Если ЭтоНовый = Истина Тогда
		ШаблонЗаголовок = НСтр("ru='Создана новая задача %1'");
	Иначе
		ШаблонЗаголовок = НСтр("ru='Изменения по задаче %1'");
	КонецЕсли;	
	Тема = СтрШаблон(ШаблонЗаголовок, Строка(ЗадачаСотрудника));	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", АдресаЭлектроннойПочты);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	
	ПочтовоеСообщение = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(ПараметрыЗадачи.УчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(ПараметрыЗадачи.УчетнаяЗапись, ПочтовоеСообщение);
	
КонецПроцедуры

#КонецОбласти
